Tekla Open API Reference for Tekla Structures 2025
AABB.IsInside Method
Overload List
Name | Description
IsInside(LineSegment)
 Checks if the given line segment is inside the current axis-aligned 3d bounding box.
IsInside(Point)
 Checks if the given point is inside the current axis-aligned 3d bounding box.
Top
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace